<unk>	0
<s>	0
</s>	0
><	-0
on	-1
="	-2
00	-3
in	-4
le	-5
ont	-6
pa	-7
▁s	-8
al	-9
font	-10
ig	-11
er	-12
ty	-13
pt	-14
tyle	-15
▁style	-16
td	-17
to	-18
></	-19
or	-20
ol	-21
ti	-22
ing	-23
spa	-24
dd	-25
span	-26
ht	-27
:1	-28
an	-29
px	-30
ight	-31
padd	-32
padding	-33
ign	-34
align	-35
si	-36
col	-37
te	-38
"><	-39
di	-40
ot	-41
en	-42
ze	-43
0000	-44
xt	-45
size	-46
tom	-47
ottom	-48
</	-49
:2	-50
bottom	-51
am	-52
il	-53
">	-54
ff	-55
eight	-56
id	-57
00;	-58
ily	-59
fam	-60
family	-61
div	-62
color	-63
text	-64
eri	-65
ver	-66
ac	-67
:#	-68
br	-69
:0	-70
es	-71
ar	-72
tic	-73
;"><	-74
li	-75
tical	-76
vertical	-77
ro	-78
th	-79
un	-80
:10	-81
xbr	-82
ent	-83
top	-84
ans	-85
▁1	-86
tion	-87
0;	-88
ft	-89
',	-90
000000;	-91
ine	-92
20	-93
us	-94
left	-95
im	-96
right	-97
▁col	-98
line	-99
und	-100
▁colspan	-101
xbrli	-102
ec	-103
height	-104
weight	-105
om	-106
:'	-107
ack	-108
erif	-109
gro	-110
serif	-111
back	-112
ground	-113
background	-114
ce	-115
it	-116
ef	-117
&#	-118
;">	-119
▁c	-120
ap	-121
em	-122
tr	-123
sans	-124
non	-125
3"	-126
:#000000;	-127
mar	-128
16	-129
="3"	-130
ord	-131
:4	-132
gin	-133
margin	-134
▁o	-135
▁N	-136
▁R	-137
re	-138
:400;	-139
wid	-140
order	-141
width	-142
ew	-143
border	-144
&#16	-145
&#160;	-146
ix	-147
Tim	-148
▁New	-149
Times	-150
:100	-151
oman	-152
▁Roman	-153
▁#	-154
ber	-155
:100%	-156
hi	-157
se	-158
ial	-159
▁th	-160
▁2	-161
ga	-162
"></	-163
rac	-164
▁f	-165
▁d	-166
olid	-167
ffff	-168
ember	-169
orm	-170
▁<	-171
gaap	-172
Ref	-173
ment	-174
ate	-175
"/	-176
inh	-177
erit	-178
inherit	-179
Member	-180
&#160;</	-181
Frac	-182
nonFrac	-183
ur	-184
▁n	-185
nonFraction	-186
▁p	-187
▁in	-188
and	-189
▁solid	-190
ext	-191
eff	-192
is	-193
"/><	-194
▁a	-195
:0.	-196
▁0	-197
cce	-198
cceeff	-199
ontext	-200
ex	-201
6"	-202
▁the	-203
Ar	-204
:9	-205
▁id	-206
ation	-207
▁and	-208
ve	-209
Arial	-210
▁of	-211
at	-212
lo	-213
imal	-214
ecimal	-215
:8	-216
:100%">	-217
ab	-218
▁b	-219
▁0;	-220
▁#000000;	-221
exp	-222
NT	-223
ed	-224
▁sc	-225
enti	-226
2"	-227
%;	-228
lic	-229
12	-230
ale	-231
In	-232
Yz	-233
','	-234
itMember	-235
xbrl	-236
▁S	-237
st	-238
▁to	-239
xbrldi	-240
202	-241
explic	-242
▁w	-243
um	-244
explicitMember	-245
ame	-246
="2"	-247
▁un	-248
:120	-249
▁name	-250
="-	-251
ffffff	-252
▁context	-253
▁contextRef	-254
:7	-255
YW	-256
sp	-257
31	-258
la	-259
ormal	-260
01	-261
▁unit	-262
TD	-263
▁m	-264
OT	-265
▁unitRef	-266
Nj	-267
▁decimal	-268
ZT	-269
;">&#160;</	-270
▁decimals	-271
▁scale	-272
▁pro	-273
ts	-274
Ax	-275
od	-276
Yj	-277
ND	-278
90	-279
ic	-280
qu	-281
low	-282
Axis	-283
▁r	-284
201	-285
OD	-286
YT	-287
Mz	-288
&#8	-289
Zj	-290
dden	-291
hidden	-292
MT	-293
none	-294
gment	-295
▁</	-296
dent	-297
.0	-298
able	-299
ue	-300
ant	-301
="6"	-302
ir	-303
ZG	-304
MD	-305
▁C	-306
ov	-307
="-6"	-308
▁di	-309
sion	-310
over	-311
usd	-312
indent	-313
;</	-314
hite	-315
Mj	-316
▁sans	-317
.5	-318
white	-319
ww	-320
ud	-321
▁re	-322
Jh	-323
space	-324
as	-325
75	-326
eriod	-327
Nz	-328
normal	-329
%">	-330
ity	-331
rap	-332
jd	-333
ier	-334
cent	-335
et	-336
flow	-337
overflow	-338
wrap	-339
▁h	-340
ali	-341
ension	-342
:100%"><	-343
ZD	-344
ch	-345
entif	-346
▁v	-347
-4	-348
;;	-349
ss	-350
FF	-351
segment	-352
entity	-353
▁form	-354
period	-355
identif	-356
context	-357
identifier	-358
:120%">	-359
ixt	-360
▁format	-361
el	-362
YWJ	-363
lay	-364
ter	-365
:700;	-366
-1	-367
25	-368
center	-369
&#82	-370
0,	-371
';	-372
▁dim	-373
YWJs	-374
splay	-375
are	-376
▁dimension	-377
display	-378
Nl	-379
FO	-380
▁our	-381
▁A	-382
ase	-383
num	-384
OW	-385
FONT	-386
ated	-387
ul	-388
Nm	-389
Ym	-390
Date	-391
bri	-392
Cali	-393
Pl	-394
Calibri	-395
LT	-396
Zm	-397
ly	-398
26	-399
alue	-400
ea	-401
tive	-402
ge	-403
▁#00	-404
jus	-405
▁for	-406
Oj	-407
ted	-408
sec	-409
IG	-410
:3	-411
old	-412
%"></	-413
ties	-414
nb	-415
NG	-416
style	-417
ons	-418
end	-419
:120%;	-420
OG	-421
ub	-422
Ex	-423
▁as	-424
arial	-425
ement	-426
MG	-427
▁inc	-428
:0.0	-429
ax	-430
air	-431
%"/><	-432
:11	-433
form	-434
est	-435
30	-436
>&#160;</	-437
per	-438
Ev	-439
pre	-440
fy	-441
IGN	-442
nbsp	-443
LIGN	-444
Plan	-445
17	-446
:6	-447
ay	-448
ess	-449
:0.5	-450
33	-451
▁or	-452
tify	-453
10	-454
MW	-455
justify	-456
ok	-457
eb	-458
sition	-459
77	-460
Value	-461
)</	-462
▁on	-463
vi	-464
tp	-465
//	-466
uc	-467
http	-468
://	-469
NW	-470
Vy	-471
:0.1	-472
ments	-473
ZW	-474
ome	-475
ook	-476
NlYz	-477
Rv	-478
bD	-479
Mud	-480
jEv	-481
inst	-482
▁B	-483
RvY	-484
ovL	-485
VybD	-486
Mm	-487
jEvZG	-488
VybDovL	-489
MudjEvZG	-490
anc	-491
www	-492
cont	-493
▁com	-494
▁T	-495
$</	-496
no	-497
Inc	-498
Fair	-499
enef	-500
▁V	-501
.</	-502
ba	-503
po	-504
gov	-505
▁P	-506
ck	-507
table	-508
instant	-509
80	-510
FairValue	-511
bold	-512
Xz	-513
ZX	-514
ility	-515
Zz	-516
Zn	-517
JhZz	-518
oun	-519
ZnJhZz	-520
ari	-521
nd	-522
▁valign	-523
dl	-524
db	-525
ities	-526
CI	-527
ith	-528
min	-529
2019	-530
24	-531
tate	-532
he	-533
0,0,	-534
idd	-535
34	-536
:0.75	-537
:12	-538
▁e	-539
trans	-540
eak	-541
iddle	-542
ance	-543
ations	-544
As	-545
eme	-546
1231	-547
break	-548
lud	-549
enefit	-550
▁sch	-551
14	-552
tica	-553
tM	-554
nowrap	-555
vZnJhZz	-556
▁#000;	-557
elve	-558
2021	-559
29	-560
inanc	-561
oration	-562
18	-563
:5	-564
:1.0	-565
▁do	-566
CIK	-567
▁scheme	-568
ain	-569
▁VA	-570
▁ac	-571
ers	-572
elvetica	-573
Lo	-574
▁t	-575
▁Sans	-576
▁VALIGN	-577
bm	-578
under	-579
203	-580
▁are	-581
dot	-582
xLT	-583
position	-584
decimal	-585
Of	-586
ther	-587
ad	-588
art	-589
/></	-590
Jhbm	-591
To	-592
Jhbmdl	-593
YWJsZT	-594
YWJsZX	-595
middle	-596
rom	-597
▁F	-598
-12	-599
Com	-600
YWJsZXJhbmdl	-601
dec	-602
▁pa	-603
▁g	-604
▁is	-605
▁be	-606
por	-607
28	-608
01-	-609
&#8203	-610
Om	-611
qui	-612
2020	-613
ined	-614
15	-615
Def	-616
cc	-617
37	-618
:0;	-619
decoration	-620
▁(	-621
ure	-622
ri	-623
sets	-624
uble	-625
ut	-626
duc	-627
And	-628
By	-629
start	-630
▁normal	-631
▁with	-632
▁D	-633
ard	-634
transform	-635
JD	-636
str	-637
▁res	-638
NlYzo	-639
endDate	-640
vari	-641
startDate	-642
variant	-643
ear	-644
Benefit	-645
47	-646
-9	-647
ZE	-648
Re	-649
21	-650
▁SI	-651
do	-652
▁SIZE	-653
5,	-654
tor	-655
pan	-656
illi	-657
39	-658
jOj	-659
rg	-660
▁cont	-661
▁double	-662
27	-663
pe	-664
fit	-665
rt	-666
word	-667
urr	-668
ased	-669
ebt	-670
▁co	-671
64	-672
▁M	-673
eve	-674
);	-675
"/></	-676
ash	-677
ital	-678
her	-679
ven	-680
▁by	-681
1231"	-682
▁an	-683
Other	-684
Income	-685
Tax	-686
31</	-687
Rh	-688
tock	-689
bility	-690
up	-691
▁book	-692
iness	-693
84	-694
35	-695
85	-696
usiness	-697
pen	-698
▁that	-699
helvetica	-700
-12-	-701
Rec	-702
content	-703
eric	-704
ating	-705
Ni	-706
Num	-707
ll	-708
>202	-709
19	-710
">0000	-711
underline	-712
3</	-713
Fi	-714
&#8212	-715
45	-716
inancial	-717
▁exp	-718
▁we	-719
36	-720
red	-721
Ri	-722
Defined	-723
og	-724
32	-725
2018	-726
&#8203;</	-727
rgba	-728
=2	-729
ore	-730
Se	-731
hare	-732
Qx	-733
86	-734
▁padding	-735
quot	-736
ecur	-737
:#0000	-738
49	-739
89	-740
▁#000000;"><	-741
vZnJhZzo	-742
Un	-743
illion	-744
ute	-745
ref	-746
tatement	-747
:100%">$</	-748
ang	-749
va	-750
11	-751
FFFF	-752
sibility	-753
de	-754
▁al	-755
="#	-756
-0	-757
0001	-758
nonNum	-759
-12-31</	-760
quity	-761
nonNumeric	-762
inu	-763
Debt	-764
stru	-765
luding	-766
Vh	-767
srt	-768
dotd	-769
ote	-770
numdotd	-771
tMS	-772
Yy	-773
%;"></	-774
visibility	-775
numdotdecimal	-776
bc	-777
My	-778
:0.1%"></	-779
ies	-780
%;">	-781
pany	-782
Rl	-783
Loss	-784
▁202	-785
44	-786
0"	-787
▁O	-788
▁Com	-789
▁le	-790
cy	-791
Fh	-792
:100%">&#160;</	-793
Zi	-794
xLTE	-795
;">&#8203;</	-796
▁rec	-797
99	-798
Zl	-799
sol	-800
▁W	-801
▁font	-802
▁ot	-803
har	-804
Statement	-805
Right	-806
if	-807
87	-808
solute	-809
255,	-810
▁from	-811
▁li	-812
ib	-813
absolute	-814
YWJsZTo	-815
Rj	-816
LE	-817
Qy	-818
▁href	-819
2</	-820
ect	-821
ize	-822
apse	-823
terest	-824
40	-825
Rk	-826
lapse	-827
ves	-828
.75	-829
vest	-830
46	-831
▁oper	-832
▁other	-833
Instru	-834
▁con	-835
collapse	-836
Nh	-837
YWJsZXJhbmdlOj	-838
Qw	-839
Vj	-840
:8.5	-841
italic	-842
tem	-843
ecurities	-844
ting	-845
Net	-846
:100%;	-847
tions	-848
sAxis	-849
Top	-850
:0.1%"/><	-851
(0,0,	-852
▁G	-853
(0,0,0,	-854
Pro	-855
▁produc	-856
Rm	-857
act	-858
▁ex	-859
DefinedBenefit	-860
88	-861
ei	-862
Vi	-863
▁ST	-864
▁us	-865
Segment	-866
age	-867
:100%">(	-868
22	-869
▁at	-870
US	-871
Qz	-872
ee	-873
▁im	-874
pti	-875
Assets	-876
Zh	-877
">1	-878
Uw	-879
▁$	-880
Equity	-881
Iw	-882
Iy	-883
▁y	-884
▁Pro	-885
▁-	-886
set	-887
95	-888
▁pr	-889
65	-890
-5	-891
▁sign	-892
Vm	-893
ract	-894
05	-895
▁L	-896
67	-897
▁In	-898
="0"	-899
38	-900
cal	-901
ning	-902
YLE	-903
Share	-904
.00	-905
▁STYLE	-906
ID	-907
ct	-908
17;	-909
▁The	-910
▁tax	-911
Ux	-912
69	-913
&#8217;	-914
68	-915
▁Book	-916
Mw	-917
▁I	-918
solid	-919
▁whi	-920
">&	-921
dbdb	-922
tain	-923
ange	-924
ustom	-925
ere	-926
tim	-927
Ji	-928
▁#0077	-929
vable	-930
▁E	-931
Jl	-932
ong	-933
Ew	-934
-8	-935
urrent	-936
dit	-937
ave	-938
onsolid	-939
OM	-940
evel	-941
&#160;&#160;	-942
ary	-943
Iz	-944
.9	-945
Ey	-946
Fm	-947
Zk	-948
eas	-949
;">$</	-950
▁'	-951
2626	-952
▁which	-953
>)</	-954
Ty	-955
Yx	-956
▁width	-957
:10.0	-958
Jk	-959
%"><	-960
Level	-961
Type	-962
Instrument	-963
▁may	-964
60	-965
Ez	-966
rement	-967
Bottom	-968
70	-969
lative	-970
Jm	-971
Fl	-972
OL	-973
▁have	-974
▁l	-975
2,	-976
ilities	-977
▁Company	-978
af	-979
TypeAxis	-980
Acc	-981
▁tr	-982
eivable	-983
&#8212;</	-984
▁ch	-985
Uz	-986
tirement	-987
6</	-988
ill	-989
▁not	-990
Cont	-991
Vk	-992
-2	-993
OR	-994
=2>	-995
1</	-996
▁border	-997
Aw	-998
4</	-999
coun	-1000
Mx	-1001
▁per	-1002
▁am	-1003
▁lo	-1004
isk	-1005
Stock	-1006
▁U	-1007
uld	-1008
jOm	-1009
NlYzp	-1010
ost	-1011
uring	-1012
Fk	-1013
Vl	-1014
ual	-1015
Li	-1016
▁cost	-1017
Ix	-1018
edg	-1019
▁ap	-1020
Nk	-1021
:7.5	-1022
Jj	-1023
inline	-1024
eriva	-1025
Non	-1026
97	-1027
1);	-1028
255,255,	-1029
:1.5	-1030
hen	-1031
sed	-1032
dddd	-1033
cd	-1034
mark	-1035
fter	-1036
ese	-1037
▁financial	-1038
▁ALIGN	-1039
pment	-1040
8</	-1041
▁es	-1042
Uy	-1043
▁ad	-1044
▁resul	-1045
01</	-1046
Per	-1047
ag	-1048
▁net	-1049
hares	-1050
redit	-1051
:1.0%"/><	-1052
ecember	-1053
▁rel	-1054
Fj	-1055
Oper	-1056
▁business	-1057
Interest	-1058
▁man	-1059
bf	-1060
relative	-1061
Securities	-1062
ices	-1063
▁#0000	-1064
55	-1065
pens	-1066
Cash	-1067
vZnJhZzp	-1068
Fact	-1069
20200	-1070
▁de	-1071
wk	-1072
Business	-1073
-01-	-1074
▁year	-1075
▁reg	-1076
-7	-1077
:0.05	-1078
="1	-1079
Am	-1080
YWJsZTp	-1081
gr	-1082
otes	-1083
:100%">(<	-1084
▁#000000	-1085
▁10	-1086
YWJsZXJhbmdlOm	-1087
▁app	-1088
Yw	-1089
ally	-1090
48	-1091
ple	-1092
ition	-1093
:1%;"></	-1094
3.	-1095
▁ce	-1096
▁it	-1097
lock	-1098
abilities	-1099
cm	-1100
ements	-1101
▁fac	-1102
▁comm	-1103
3,	-1104
ates	-1105
;,	-1106
ca	-1107
▁mark	-1108
31,	-1109
66	-1110
erivative	-1111
Asset	-1112
▁pl	-1113
:&	-1114
50	-1115
42	-1116
;"	-1117
continu	-1118
ertain	-1119
ales	-1120
ents	-1121
2017	-1122
ency	-1123
port	-1124
:18	-1125
hib	-1126
Receivable	-1127
ays	-1128
%</	-1129
FFFFFF	-1130
▁income	-1131
:1.0%"></	-1132
ata	-1133
sive	-1134
term	-1135
▁assets	-1136
▁cell	-1137
hibit	-1138
For	-1139
Bh	-1140
pon	-1141
82	-1142
9;	-1143
At	-1144
pensation	-1145
0);	-1146
Res	-1147
ective	-1148
▁ass	-1149
.25	-1150
venue	-1151
▁ser	-1152
(0,0,0,0);	-1153
▁sub	-1154
erred	-1155
79	-1156
vid	-1157
xLTEt	-1158
4_	-1159
FairValueBy	-1160
inancing	-1161
▁products	-1162
From	-1163
▁includ	-1164
FD	-1165
ug	-1166
bb	-1167
ci	-1168
▁impa	-1169
ran	-1170
▁text	-1171
USD	-1172
ved	-1173
▁J	-1174
="-"	-1175
rease	-1176
rol	-1177
aa	-1178
urch	-1179
ability	-1180
;&	-1181
The	-1182
41	-1183
▁million	-1184
▁including	-1185
hh	-1186
ized	-1187
▁value	-1188
onsolidated	-1189
nti	-1190
ence	-1191
ues	-1192
vice	-1193
Retirement	-1194
ort	-1195
5;	-1196
▁en	-1197
fe	-1198
▁expen	-1199
Pay	-1200
">&#160;</	-1201
bl	-1202
ogn	-1203
erm	-1204
5</	-1205
tors	-1206
gy	-1207
:#00	-1208
▁eff	-1209
▁su	-1210
gre	-1211
▁dis	-1212
ddition	-1213
zer	-1214
;">(	-1215
Based	-1216
RetirementPlan	-1217
hic	-1218
our	-1219
▁mat	-1220
efef	-1221
.7	-1222
FC	-1223
;">&	-1224
59	-1225
ptions	-1226
▁cash	-1227
&#8212;	-1228
▁December	-1229
ific	-1230
cing	-1231
▁#0	-1232
▁could	-1233
arch	-1234
continuation	-1235
tern	-1236
vices	-1237
Bi	-1238
▁custom	-1239
ures	-1240
Derivative	-1241
COL	-1242
ixed	-1243
fa	-1244
prehen	-1245
bd	-1246
prehensive	-1247
▁We	-1248
9"	-1249
▁te	-1250
ous	-1251
pr	-1252
">00000	-1253
cess	-1254
AD	-1255
pu	-1256
ell	-1257
▁right	-1258
▁related	-1259
page	-1260
be	-1261
2022	-1262
try	-1263
-1"	-1264
ount	-1265
kx	-1266
sMember	-1267
▁invest	-1268
lh	-1269
▁Re	-1270
Operating	-1271
spacing	-1272
▁st	-1273
▁was	-1274
▁stock	-1275
▁under	-1276
57	-1277
led	-1278
">1,	-1279
ationAxis	-1280
.1	-1281
Item	-1282
NS	-1283
AP	-1284
ShareBased	-1285
3_	-1286
plo	-1287
hr	-1288
Cost	-1289
IN	-1290
▁off	-1291
▁pay	-1292
ploy	-1293
TR	-1294
Az	-1295
Invest	-1296
efore	-1297
kz	-1298
.2	-1299
COLOR	-1300
5"	-1301
54	-1302
0101-	-1303
lin	-1304
ected	-1305
-01-01</	-1306
Financing	-1307
kw	-1308
ulated	-1309
zed	-1310
;">&#	-1311
▁operations	-1312
▁H	-1313
-6	-1314
arr	-1315
Helvetica	-1316
-3	-1317
▁these	-1318
:1%;	-1319
;">)</	-1320
iscal	-1321
ak	-1322
">0001	-1323
78	-1324
evelo	-1325
DebtInstrument	-1326
orpor	-1327
blig	-1328
▁"	-1329
20201231"	-1330
9</	-1331
fc	-1332
6">	-1333
sis	-1334
▁Ex	-1335
▁7	-1336
Year	-1337
▁po	-1338
fd	-1339
98	-1340
ued	-1341
NC	-1342
__	-1343
NTQ	-1344
hj	-1345
▁ref	-1346
tatements	-1347
1,	-1348
▁0.75	-1349
na	-1350
easur	-1351
ateg	-1352
479	-1353
puts	-1354
vail	-1355
IncomeLoss	-1356
▁certain	-1357
ae	-1358
ways	-1359
ten	-1360
▁market	-1361
Equi	-1362
▁par	-1363
4"	-1364
tory	-1365
:1.	-1366
▁such	-1367
Rate	-1368
hip	-1369
▁over	-1370
13	-1371
tric	-1372
dbdbdb	-1373
Expen	-1374
43	-1375
ener	-1376
wn	-1377
">&#8212;</	-1378
always	-1379
sses	-1380
▁costs	-1381
Dis	-1382
Uni	-1383
Plans	-1384
Or	-1385
:</	-1386
formation	-1387
lec	-1388
96	-1389
4,	-1390
St	-1391
gz	-1392
umulated	-1393
Ser	-1394
after	-1395
so	-1396
YTD	-1397
NjQ	-1398
Period	-1399
FairValueH	-1400
Comm	-1401
overn	-1402
cw	-1403
CFF	-1404
lj	-1405
▁BG	-1406
▁sales	-1407
3333	-1408
▁se	-1409
zation	-1410
26;	-1411
hm	-1412
ases	-1413
otal	-1414
Expense	-1415
oreign	-1416
archy	-1417
▁BGCOLOR	-1418
dh	-1419
IncomeTax	-1420
truc	-1421
1"	-1422
change	-1423
ption	-1424
ho	-1425
dm	-1426
▁qu	-1427
▁sup	-1428
ky	-1429
262626;	-1430
Compensation	-1431
OTT	-1432
Bm	-1433
SegmentsAxis	-1434
▁operating	-1435
just	-1436
Loc	-1437
lk	-1438
BOTT	-1439
8080	-1440
NV	-1441
BOTTOM	-1442
▁trans	-1443
cluding	-1444
62	-1445
ognized	-1446
Comprehensive	-1447
gx	-1448
93	-1449
Bk	-1450
Gain	-1451
94	-1452
1_	-1453
▁$<	-1454
▁pri	-1455
:-1	-1456
▁&#82	-1457
ings	-1458
fb	-1459
Bl	-1460
20;	-1461
▁due	-1462
cb	-1463
exhibit	-1464
&#8221	-1465
07	-1466
ZXh	-1467
cmV	-1468
naW	-1469
Contract	-1470
Inputs	-1471
ker	-1472
ibu	-1473
ach	-1474
cmVnaW	-1475
32;	-1476
(0,0,0,1);	-1477
▁provid	-1478
ible	-1479
1-	-1480
bo	-1481
LocationAxis	-1482
Long	-1483
▁continu	-1484
="-2"	-1485
oli	-1486
▁were	-1487
hold	-1488
ierarchy	-1489
Total	-1490
vailable	-1491
Foreign	-1492
alance	-1493
ork	-1494
▁;	-1495
▁me	-1496
anges	-1497
andard	-1498
92	-1499
fixed	-1500
▁its	-1501
cx	-1502
▁1.0	-1503
8"	-1504
LevelAxis	-1505
▁end	-1506
Le	-1507
number	-1508
1231"><	-1509
ssi	-1510
verage	-1511
uture	-1512
perty	-1513
hk	-1514
▁LT	-1515
20211231"	-1516
YTQ	-1517
esign	-1518
▁has	-1519
&#8203;	-1520
>2023	-1521
Tc	-1522
▁em	-1523
▁addition	-1524
dc	-1525
au	-1526
Table	-1527
4.	-1528
orti	-1529
000	-1530
kerning	-1531
ER	-1532
dic	-1533
alu	-1534
▁risk	-1535
Accumulated	-1536
lm	-1537
FI	-1538
da	-1539
Ac	-1540
56	-1541
▁period	-1542
>&#8203;	-1543
ounts	-1544
▁estim	-1545
MA	-1546
We	-1547
&#8221;	-1548
olog	-1549
NjM	-1550
Measur	-1551
venues	-1552
gw	-1553
Enti	-1554
30</	-1555
gram	-1556
▁margin	-1557
58	-1558
>2021	-1559
Award	-1560
ses	-1561
arning	-1562
--	-1563
▁Cont	-1564
▁billion	-1565
7</	-1566
ood	-1567
▁develo	-1568
5_	-1569
>2020	-1570
Text	-1571
ward	-1572
▁def	-1573
▁will	-1574
>2022	-1575
ra	-1576
zero	-1577
(255,255,	-1578
htm	-1579
76	-1580
(255,255,255,	-1581
▁la	-1582
quired	-1583
Current	-1584
iation	-1585
▁any	-1586
ns	-1587
ificant	-1588
▁repor	-1589
▁j	-1590
Sons	-1591
▁Light	-1592
▁fair	-1593
▁dot	-1594
dddddd	-1595
df	-1596
InputsLevel	-1597
▁appro	-1598
angible	-1599
cz	-1600
▁--	-1601
_10	-1602
▁also	-1603
▁dotted	-1604
RAP	-1605
▁NOW	-1606
With	-1607
Notes	-1608
xLTEtM	-1609
▁NOWRAP	-1610
▁dec	-1611
&#8212;&#160;</	-1612
extract	-1613
>2024	-1614
formance	-1615
OC	-1616
▁tim	-1617
ling	-1618
ategor	-1619
Pension	-1620
!--	-1621
-10	-1622
tangible	-1623
HT	-1624
▁20	-1625
dj	-1626
74	-1627
block	-1628
urrency	-1629
ugh	-1630
hl	-1631
MzQ	-1632
los	-1633
9-	-1634
par	-1635
>2019	-1636
overnment	-1637
:36	-1638
▁prim	-1639
=2></	-1640
lass	-1641
Produc	-1642
▁interest	-1643
Tr	-1644
MjQ	-1645
▁services	-1646
ross	-1647
▁<!--	-1648
;">&#32;	-1649
▁information	-1650
IGHT	-1651
Unit	-1652
cf	-1653
3-	-1654
▁201	-1655
Service	-1656
▁-->	-1657
alized	-1658
fic	-1659
ject	-1660
ied	-1661
Before	-1662
YzQ	-1663
we	-1664
Term	-1665
Dec	-1666
agement	-1667
AssetC	-1668
▁aff	-1669
▁this	-1670
3">	-1671
ODQ	-1672
26;</	-1673
ational	-1674
arily	-1675
04	-1676
&#8226;</	-1677
▁au	-1678
▁accoun	-1679
apital	-1680
NjU	-1681
GainLoss	-1682
202001	-1683
alen	-1684
:#262626;	-1685
Ad	-1686
Custom	-1687
▁COM	-1688
xLTEtMA	-1689
Credit	-1690
200	-1691
▁future	-1692
8-	-1693
81	-1694
▁fi	-1695
Nzc	-1696
Po	-1697
2_	-1698
316	-1699
OS	-1700
ponent	-1701
Bj	-1702
MS	-1703
71	-1704
▁#8080	-1705
▁results	-1706
truct	-1707
ast	-1708
▁31,	-1709
nolog	-1710
lassi	-1711
▁size	-1712
vers	-1713
▁out	-1714
ini	-1715
7,	-1716
EtMS	-1717
uary	-1718
thod	-1719
▁materi	-1720
MzY	-1721
▁liabilities	-1722
▁ev	-1723
ADD	-1724
Lease	-1725
.8	-1726
▁benefit	-1727
dk	-1728
PlanAssets	-1729
▁customers	-1730
les	-1731
▁&#8220;	-1732
edging	-1733
▁gener	-1734
▁acc	-1735
▁new	-1736
Revenue	-1737
ys	-1738
Percent	-1739
▁gro	-1740
7">	-1741
urchase	-1742
91	-1743
▁2020	-1744
▁pre	-1745
ail	-1746
quisition	-1747
Ny	-1748
2">	-1749
ZjQ	-1750
MTQ	-1751
chi	-1752
ade	-1753
:120%"><	-1754
▁significant	-1755
20200101-	-1756
Deferred	-1757
▁rate	-1758
data	-1759
▁their	-1760
valen	-1761
ategories	-1762
▁share	-1763
ape	-1764
arnings	-1765
▁Inc	-1766
Archi	-1767
61	-1768
XzE	-1769
co	-1770
edgar	-1771
▁continued	-1772
31_	-1773
▁3	-1774
Ay	-1775
Excluding	-1776
Archives	-1777
AN	-1778
,"	-1779
NDQ	-1780
▁non	-1781
▁impact	-1782
_10_	-1783
RIGHT	-1784
▁tech	-1785
ollow	-1786
sup	-1787
;"></	-1788
▁changes	-1789
Risk	-1790
877	-1791
ble	-1792
▁primarily	-1793
▁based	-1794
▁all	-1795
NzQ	-1796
▁str	-1797
23	-1798
▁adver	-1799
clos	-1800
EC	-1801
ByPlan	-1802
true	-1803
Financial	-1804
MDk	-1805
rank	-1806
OTE	-1807
ZV	-1808
09	-1809
Arr	-1810
▁.	-1811
ograp	-1812
▁Got	-1813
▁follow	-1814
NDI	-1815
Frank	-1816
Customer	-1817
▁face	-1818
▁Gothic	-1819
:24	-1820
▁Financial	-1821
rough	-1822
Entity	-1823
=2>&	-1824
▁years	-1825
63	-1826
▁consolidated	-1827
MTI	-1828
▁cellpadding	-1829
51	-1830
OTM	-1831
▁cellspacing	-1832
asis	-1833
▁up	-1834
base	-1835
Franklin	-1836
83	-1837
holders	-1838
%"	-1839
ia	-1840
▁statements	-1841
for	-1842
onsolidation	-1843
PlanByPlan	-1844
auto	-1845
YS	-1846
Th	-1847
Liabilities	-1848
▁esc	-1849
▁iss	-1850
PlanByPlanAssetC	-1851
DebtSecurities	-1852
MAND	-1853
MDQ	-1854
ces	-1855
:14	-1856
▁fore	-1857
▁COMMAND	-1858
Benef	-1859
▁debt	-1860
erc	-1861
MTc	-1862
52	-1863
LTEtMS	-1864
Component	-1865
▁2021	-1866
tribu	-1867
:4.5	-1868
arry	-1869
▁br	-1870
YTA	-1871
▁fiscal	-1872
MTY	-1873
▁i	-1874
▁incre	-1875
.4	-1876
On	-1877
Njk	-1878
ystem	-1879
08	-1880
_0001	-1881
rec	-1882
▁resp	-1883
valents	-1884
OWQ	-1885
20221231"	-1886
▁escape	-1887
ZGI	-1888
▁record	-1889
Arrang	-1890
AT	-1891
:130	-1892
MGI	-1893
NDg	-1894
▁law	-1895
▁foreign	-1896
baseline	-1897
▁ga	-1898
Al	-1899
NWU	-1900
">(	-1901
03	-1902
his	-1903
ances	-1904
53	-1905
ative	-1906
▁intern	-1907
row	-1908
StatementEquity	-1909
ComponentsAxis	-1910
.6	-1911
PerShare	-1912
tivi	-1913
ZC	-1914
ODM	-1915
enter	-1916
31"	-1917
6-	-1918
NDM	-1919
YmU	-1920
ortization	-1921
ree	-1922
pli	-1923
IA	-1924
&#160;31,	-1925
tivities	-1926
ategoriesAxis	-1927
▁result	-1928
2-	-1929
Consolidation	-1930
ond	-1931
efefef	-1932
="9"	-1933
eni	-1934
;">&#8212;</	-1935
▁program	-1936
racts	-1937
xLTA	-1938
anding	-1939
87722	-1940
MGY	-1941
Mjc	-1942
Due	-1943
Amount	-1944
6;	-1945
DefinedBenef	-1946
▁2019	-1947
Block	-1948
▁continuedAt	-1949
▁credit	-1950
ODc	-1951
▁cons	-1952
OGY	-1953
TextBlock	-1954
ceed	-1955
▁ne	-1956
ced	-1957
▁tran	-1958
orporate	-1959
▁control	-1960
shares	-1961
ately	-1962
OTQ	-1963
pro	-1964
ODk	-1965
Mi	-1966
OTg	-1967
Sale	-1968
OGI	-1969
:100%">%</	-1970
▁securities	-1971
▁equi	-1972
▁ret	-1973
▁employ	-1974
arter	-1975
0</	-1976
YjU	-1977
ItemsAxis	-1978
▁Ch	-1979
enior	-1980
Equipment	-1981
istr	-1982
NzI	-1983
sid	-1984
bligations	-1985
▁det	-1986
olic	-1987
▁Contents	-1988
NDE	-1989
4%;	-1990
standing	-1991
CA	-1992
ler	-1993
:-18	-1994
ortf	-1995
▁adverse	-1996
ZS	-1997
olio	-1998
72	-1999
▁Form	-2000
▁0.0	-2001
tricted	-2002
based	-2003
ffic	-2004
▁k	-2005
fact	-2006
ees	-2007
▁can	-2008
▁agre	-2009
▁2.25	-2010
73	-2011
5-	-2012
amp	-2013
ED	-2014
▁current	-2015
ater	-2016
ortfolio	-2017
378	-2018
Property	-2019
▁technolog	-2020
ZTA	-2021
Yi	-2022
Ge	-2023
MzA	-2024
▁hig	-2025
uOj	-2026
▁so	-2027
▁sp	-2028
ured	-2029
quir	-2030
▁through	-2031
MC	-2032
Product	-2033
illions	-2034
▁expense	-2035
▁revenue	-2036
▁company	-2037
all	-2038
aluation	-2039
▁.0001	-2040
Arrangement	-2041
MjY	-2042
80;	-2043
XzI	-2044
Hedging	-2045
30"	-2046
fo	-2047
tributable	-2048
▁material	-2049
Standard	-2050
▁included	-2051
int	-2052
MzU	-2053
Adjust	-2054
6,	-2055
YmY	-2056
02	-2057
ODA	-2058
NjE	-2059
OTA	-2060
▁x	-2061
Intangible	-2062
FairValueOf	-2063
oll	-2064
▁#808080;	-2065
0%"><	-2066
▁than	-2067
Investment	-2068
▁condi	-2069
NmU	-2070
▁product	-2071
20191231"	-2072
▁common	-2073
▁vari	-2074
▁into	-2075
▁if	-2076
MWE	-2077
RhYm	-2078
mit	-2079
ZmY	-2080
OTI	-2081
9_	-2082
202201	-2083
onsor	-2084
Geograp	-2085
ati	-2086
▁subject	-2087
06	-2088
YjY	-2089
▁transac	-2090
inance	-2091
▁no	-2092
2.	-2093
rel	-2094
ical	-2095
NmE	-2096
),	-2097
:2.0	-2098
Liability	-2099
▁time	-2100
▁2018	-2101
Sp	-2102
AB	-2103
MDY	-2104
cmF	-2105
="-5"	-2106
eld	-2107
SP	-2108
ortion	-2109
Measurement	-2110
4-	-2111
29</	-2112
MTA	-2113
thor	-2114
NGU	-2115
org	-2116
SegmentMember	-2117
ZmM	-2118
▁ended	-2119
87722;	-2120
:100.00	-2121
▁sty	-2122
Air	-2123
NWE	-2124
Available	-2125
IDIA	-2126
NTg	-2127
NjY	-2128
lob	-2129
Instruments	-2130
Payment	-2131
▁more	-2132
▁Th	-2133
country	-2134
▁been	-2135
▁performance	-2136
▁use	-2137
ets	-2138
xl	-2139
▁well	-2140
ges	-2141
Shares	-2142
ware	-2143
▁ind	-2144
ZWM	-2145
ZTQ	-2146
20210101-	-2147
stre	-2148
CE	-2149
hical	-2150
▁45	-2151
▁investments	-2152
Me	-2153
:100.000%"><	-2154
.3	-2155
ark	-2156
WithCustomer	-2157
control	-2158
av	-2159
RhYmxl	-2160
▁management	-2161
MzI	-2162
NDc	-2163
Common	-2164
OGE	-2165
NDA	-2166
▁div	-2167
▁Our	-2168
>2025	-2169
▁increase	-2170
NzU	-2171
XzM	-2172
>&#8203;<	-2173
▁An	-2174
▁flow	-2175
NDY	-2176
20190	-2177
YTY	-2178
:-9	-2179
▁ca	-2180
YmI	-2181
▁inte	-2182
fication	-2183
▁data	-2184
:1.9	-2185
will	-2186
Geographical	-2187
MjM	-2188
GR	-2189
MDU	-2190
Trans	-2191
▁expenses	-2192
tter	-2193
MTE	-2194
controlling	-2195
▁plan	-2196
MTg	-2197
erence	-2198
ZDg	-2199
Univers	-2200
▁equity	-2201
▁include	-2202
De	-2203
Balance	-2204
ank	-2205
▁compe	-2206
bnb	-2207
cil	-2208
pl	-2209
▁serif	-2210
Eff	-2211
TH	-2212
YjA	-2213
837	-2214
YzI	-2215
16316	-2216
urring	-2217
;">$	-2218
Mzk	-2219
oci	-2220
Airbnb	-2221
PensionPlans	-2222
spar	-2223
NWM	-2224
ereal	-2225
IntangibleAssets	-2226
GeographicalAxis	-2227
▁regul	-2228
closure	-2229
▁part	-2230
7"	-2231
inite	-2232
▁Cereal	-2233
tructuring	-2234
NTU	-2235
NjI	-2236
NGY	-2237
0.	-2238
heet	-2239
▁rates	-2240
ule	-2241
ufact	-2242
:13	-2243
-16	-2244
▁transpar	-2245
arrying	-2246
▁5	-2247
ercial	-2248
EvZnJhZz	-2249
▁long	-2250
▁middle	-2251
oh	-2252
GRID	-2253
▁coun	-2254
onom	-2255
="1"	-2256
OTk	-2257
fied	-2258
Investments	-2259
tle	-2260
▁contracts	-2261
101	-2262
▁requir	-2263
YjE	-2264
uration	-2265
ODY	-2266
ose	-2267
oodwill	-2268
ZTY	-2269
NlYzpj	-2270
11_	-2271
▁system	-2272
jn	-2273
Sponsor	-2274
:6.5	-2275
imum	-2276
go	-2277
sions	-2278
333333	-2279
ationship	-2280
oncil	-2281
▁losses	-2282
YjI	-2283
rued	-2284
Our	-2285
▁loss	-2286
▁char	-2287
Sub	-2288
PaymentAward	-2289
jnj	-2290
▁laws	-2291
lobal	-2292
7-	-2293
Percentage	-2294
Plant	-2295
Payments	-2296
ectively	-2297
>2018	-2298
YTM	-2299
NzE	-2300
▁transparent	-2301
01_	-2302
nual	-2303
▁amount	-2304
MzM	-2305
orp	-2306
ForSale	-2307
OTY	-2308
utive	-2309
▁currency	-2310
▁10-	-2311
▁government	-2312
▁segment	-2313
uro	-2314
Including	-2315
MTU	-2316
iti	-2317
MjA	-2318
YWI	-2319
AndEquipment	-2320
▁K	-2321
▁Am	-2322
▁As	-2323
ODI	-2324
OrService	-2325
letter	-2326
INF	-2327
EM	-2328
YzY	-2329
urn	-2330
;">,	-2331
:128	-2332
MmM	-2333
▁ar	-2334
9">	-2335
Ch	-2336
Mjg	-2337
atur	-2338
6%;	-2339
NetOf	-2340
Yzc	-2341
OrServiceAxis	-2342
MTM	-2343
OF	-2344
Average	-2345
OWI	-2346
8,	-2347
▁10.00	-2348
▁additional	-2349
:120%">&#8226;</	-2350
MjU	-2351
Njc	-2352
20210	-2353
ake	-2354
____	-2355
edi	-2356
ZTc	-2357
eighted	-2358
MWU	-2359
▁reporting	-2360
NVIDIA	-2361
:100%">202	-2362
NTc	-2363
irment	-2364
_11_	-2365
inci	-2366
Gross	-2367
:-0	-2368
Weighted	-2369
YjQ	-2370
Yjc	-2371
ODE	-2372
▁manufact	-2373
hort	-2374
▁align	-2375
▁price	-2376
MDA	-2377
ES	-2378
the	-2379
▁/	-2380
▁development	-2381
PropertyPlant	-2382
current	-2383
ends	-2384
▁payments	-2385
ZjE	-2386
umptions	-2387
▁lease	-2388
NGM	-2389
ace	-2390
10</	-2391
NjA	-2392
Duration	-2393
▁recorded	-2394
rib	-2395
YzM	-2396
YTk	-2397
ZGQ	-2398
rgb	-2399
YWY	-2400
ZGM	-2401
MWQ	-2402
ArrangementBy	-2403
Mjk	-2404
com	-2405
MmQ	-2406
os	-2407
ury	-2408
▁quarter	-2409
MjE	-2410
YmM	-2411
cus	-2412
Yjk	-2413
▁applic	-2414
MDc	-2415
xim	-2416
▁2017	-2417
▁#378	-2418
XzQ	-2419
orporation	-2420
NDU	-2421
bligation	-2422
▁term	-2423
Con	-2424
▁Report	-2425
ZWU	-2426
million	-2427
AvailableForSale	-2428
PlanFairValueOf	-2429
16</	-2430
MDE	-2431
▁:	-2432
ird	-2433
gal	-2434
ld	-2435
▁following	-2436
:16	-2437
use	-2438
OWU	-2439
sider	-2440
OTU	-2441
▁fund	-2442
NTk	-2443
▁abo	-2444
bot	-2445
YV	-2446
(<	-2447
Lived	-2448
">2,	-2449
2019_	-2450
Amortization	-2451
▁tot	-2452
NTY	-2453
ZWY	-2454
OWM	-2455
sh	-2456
orporated	-2457
ODU	-2458
▁customer	-2459
YWU	-2460
100	-2461
du	-2462
umer	-2463
▁design	-2464
Allow	-2465
aj	-2466
tee	-2467
anuary	-2468
9,	-2469
:20	-2470
▁used	-2471
onth	-2472
▁process	-2473
Zjk	-2474
FromContract	-2475
Reconcil	-2476
▁revenues	-2477
="2	-2478
ust	-2479
▁grow	-2480
Yzk	-2481
utions	-2482
';">	-2483
:42	-2484
▁12	-2485
ey	-2486
▁COL	-2487
▁shares	-2488
▁inter	-2489
▁taxes	-2490
ecurity	-2491
MGE	-2492
ving	-2493
▁activities	-2494
▁basis	-2495
AS	-2496
YWE	-2497
Noncontrolling	-2498
31837	-2499
MGQ	-2500
▁third	-2501
:1%;">	-2502
Equivalents	-2503
31837;	-2504
29,	-2505
▁recognized	-2506
Mzg	-2507
of	-2508
ie	-2509
▁7.75	-2510
odi	-2511
stretirement	-2512
▁expected	-2513
Reclassi	-2514
IT	-2515
YTc	-2516
/0001	-2517
YWM	-2518
ZWQ	-2519
▁affect	-2520
put	-2521
Class	-2522
0_	-2523
▁competi	-2524
Nzg	-2525
:13.	-2526
prec	-2527
ZGY	-2528
CashEquivalents	-2529
ffer	-2530
ects	-2531
laim	-2532
ZTg	-2533
tici	-2534
="6">	-2535
BB	-2536
▁each	-2537
:0.1%	-2538
ajor	-2539
:96	-2540
MDM	-2541
:15	-2542
▁plans	-2543
United	-2544
▁set	-2545
Method	-2546
OV	-2547
NzA	-2548
MzE	-2549
Rel	-2550
tiv	-2551
fr	-2552
▁amounts	-2553
YTI	-2554
umber	-2555
requ	-2556
▁obligations	-2557
igation	-2558
▁lic	-2559
27</	-2560
ense	-2561
NlYzow	-2562
here	-2563
ZDQ	-2564
▁during	-2565
ssessed	-2566
tates	-2567
ula	-2568
▁those	-2569
>2024-12-31</	-2570
▁required	-2571
Assessed	-2572
InterestRate	-2573
orld	-2574
Options	-2575
AssessedTax	-2576
>2023-12-31</	-2577
ply	-2578
:0.1%"/></	-2579
ru	-2580
Attributable	-2581
realized	-2582
YjM	-2583
MDI	-2584
XzU	-2585
enc	-2586
NTM	-2587
wo	-2588
tit	-2589
Note	-2590
vol	-2591
▁pres	-2592
MWI	-2593
:42.75	-2594
NGE	-2595
ZjM	-2596
6_	-2597
lation	-2598
OWE	-2599
tMy	-2600
▁offer	-2601
▁capital	-2602
AC	-2603
SPAN	-2604
▁approxim	-2605
▁19	-2606
▁work	-2607
▁increased	-2608
NetOfTax	-2609
Par	-2610
Recurring	-2611
NmI	-2612
Fiscal	-2613
MjI	-2614
AttributableTo	-2615
▁COLSPAN	-2616
28</	-2617
encies	-2618
▁earnings	-2619
:9.0	-2620
:0.01	-2621
emain	-2622
▁vol	-2623
24</	-2624
sidi	-2625
▁filed	-2626
▁service	-2627
OGQ	-2628
ched	-2629
▁Notes	-2630
ollar	-2631
>2022-12-31</	-2632
▁fo	-2633
▁contract	-2634
▁These	-2635
▁total	-2636
▁millions	-2637
▁associ	-2638
ZWI	-2639
▁ec	-2640
SU	-2641
:5.	-2642
▁Act	-2643
YWQ	-2644
mploy	-2645
dei	-2646
7;	-2647
OTc	-2648
Portfolio	-2649
ained	-2650
▁ability	-2651
ult	-2652
ZGU	-2653
ection	-2654
Out	-2655
▁For	-2656
pri	-2657
▁prote	-2658
LongTerm	-2659
ZDY	-2660
▁bet	-2661
Revenues	-2662
0-	-2663
aid	-2664
▁Se	-2665
▁pur	-2666
IDTH	-2667
Restructuring	-2668
:48	-2669
/>	-2670
NTA	-2671
▁acquisition	-2672
eral	-2673
▁comple	-2674
Stockholders	-2675
edge	-2676
pal	-2677
preciation	-2678
initeLived	-2679
urope	-2680
OWY	-2681
SegmentsMember	-2682
20190101-	-2683
NzM	-2684
▁Stock	-2685
ZjY	-2686
▁nt	-2687
:9.5	-2688
DebtTypeAxis	-2689
ner	-2690
▁Statements	-2691
role	-2692
EB	-2693
▁ob	-2694
▁reference	-2695
ptember	-2696
▁WIDTH	-2697
NmY	-2698
ecutive	-2699
During	-2700
PlanMember	-2701
▁risks	-2702
▁provide	-2703
ould	-2704
Iss	-2705
OGM	-2706
Yjg	-2707
Noncurrent	-2708
1">	-2709
RiskAxis	-2710
:-0.1	-2711
ina	-2712
December	-2713
▁low	-2714
EquityMethod	-2715
▁change	-2716
:2.	-2717
▁after	-2718
▁Medi	-2719
roup	-2720
Continu	-2721
WeightedAverage	-2722
▁Plan	-2723
▁equipment	-2724
17</	-2725
:1.05;	-2726
4">	-2727
Longterm	-2728
ins	-2729
▁="	-2730
114	-2731
8">	-2732
▁respectively	-2733
:130%">	-2734
NWI	-2735
▁when	-2736
▁ins	-2737
:#333333	-2738
Reconciliation	-2739
ublic	-2740
▁asset	-2741
cat	-2742
panies	-2743
YmQ	-2744
▁Next	-2745
Sales	-2746
▁one	-2747
ead	-2748
DER	-2749
▁consider	-2750
677	-2751
▁dem	-2752
onomic	-2753
▁0"><	-2754
2.5	-2755
Disclosure	-2756
ction	-2757
ounting	-2758
Restricted	-2759
sident	-2760
NmM	-2761
jp	-2762
ederal	-2763
ween	-2764
▁approximately	-2765
nded	-2766
inue	-2767
OGU	-2768
NDk	-2769
ice	-2770
quire	-2771
=2>&#8203;</	-2772
315	-2773
▁number	-2774
fff	-2775
▁within	-2776
gainst	-2777
Pr	-2778
sia	-2779
YTE	-2780
:128%">	-2781
DIN	-2782
▁receivable	-2783
Adjustment	-2784
▁main	-2785
▁regulations	-2786
ceeds	-2787
▁available	-2788
▁exchange	-2789
▁develop	-2790
▁position	-2791
▁bec	-2792
wards	-2793
ters	-2794
8_	-2795
:7.0	-2796
erves	-2797
Di	-2798
NlYzpl	-2799
▁percent	-2800
lect	-2801
▁Corporation	-2802
:8.0	-2803
Accrued	-2804
-24	-2805
loc	-2806
Pri	-2807
▁generally	-2808
lection	-2809
MF	-2810
urance	-2811
ZTI	-2812
NlYzox	-2813
Yl	-2814
cop	-2815
▁claim	-2816
NTE	-2817
MmI	-2818
vir	-2819
▁allow	-2820
>2020-12-31</	-2821
789	-2822
▁adversely	-2823
▁ve	-2824
▁date	-2825
NGQ	-2826
▁ag	-2827
ZDc	-2828
MDg	-2829
tent	-2830
dding	-2831
:0%;	-2832
ohns	-2833
▁8	-2834
▁continue	-2835
▁would	-2836
ZmQ	-2837
ustry	-2838
ohnson	-2839
incipal	-2840
Ass	-2841
▁accounting	-2842
ZjI	-2843
▁fir	-2844
Operations	-2845
tries	-2846
▁who	-2847
tivity	-2848
▁he	-2849
▁#000000;">	-2850
▁associated	-2851
▁9	-2852
ORDER	-2853
Finance	-2854
viron	-2855
>2021-12-31</	-2856
AL	-2857
▁investment	-2858
ution	-2859
).	-2860
Design	-2861
_1	-2862
otenti	-2863
2;	-2864
pres	-2865
requency	-2866
▁effective	-2867
gm	-2868
▁regula	-2869
Postretirement	-2870
▁employees	-2871
alth	-2872
20220101-	-2873
:12.	-2874
YTU	-2875
▁order	-2876
▁spec	-2877
Njg	-2878
Effective	-2879
▁200	-2880
MmU	-2881
▁reas	-2882
▁against	-2883
▁between	-2884
=2><	-2885
▁Res	-2886
▁transactions	-2887
Sheet	-2888
ou	-2889
uOm	-2890
>&#160;	-2891
irec	-2892
YTg	-2893
▁January	-2894
Reclassification	-2895
▁Dis	-2896
NlYzpi	-2897
-45	-2898
▁Acc	-2899
▁ont	-2900
▁top	-2901
Portion	-2902
dG	-2903
:8.	-2904
-47	-2905
▁bot	-2906
▁requirements	-2907
▁estimated	-2908
-40	-2909
BalanceSheet	-2910
▁meas	-2911
7_	-2912
Unrealized	-2913
▁systems	-2914
YmE	-2915
▁flows	-2916
CommonStock	-2917
7,24	-2918
▁agreements	-2919
ist	-2920
▁bottom	-2921
ser	-2922
0,25	-2923
▁experi	-2924
(20	-2925
sing	-2926
▁using	-2927
greement	-2928
ke	-2929
▁technology	-2930
zerod	-2931
4217	-2932
▁growth	-2933
2020_	-2934
▁potenti	-2935
iso	-2936
2,1);	-2937
▁De	-2938
Im	-2939
zerodash	-2940
▁production	-2941
(207,24	-2942
0,252,1);	-2943
uted	-2944
AndOther	-2945
EA	-2946
ages	-2947
9.	-2948
ZmI	-2949
Goodwill	-2950
side	-2951
earch	-2952
usdPerShare	-2953
NlYzoy	-2954
Senior	-2955
▁internal	-2956
Exp	-2957
▁his	-2958
(207,240,252,1);	-2959
ild	-2960
Employ	-2961
▁Medium	-2962
▁recei	-2963
ODg	-2964
ventory	-2965
;">1,	-2966
aries	-2967
YzU	-2968
▁adjust	-2969
▁benefits	-2970
mental	-2971
▁><	-2972
EvZnJhZzo	-2973
Number	-2974
_6	-2975
fon	-2976
-20	-2977
">5	-2978
:-2	-2979
Than	-2980
▁vehic	-2981
ants	-2982
NGI	-2983
▁States	-2984
▁factors	-2985
11;	-2986
▁cr	-2987
CashAnd	-2988
XzY	-2989
▁Offic	-2990
dex	-2991
olicy	-2992
MTk	-2993
ftware	-2994
▁they	-2995
.,	-2996
="-8"	-2997
one	-2998
BeforeTax	-2999
▁beli	-3000
chedule	-3001
_000116316	-3002
..	-3003
Measurements	-3004
>2019-12-31</	-3005
Frequency	-3006
▁balance	-3007
10.	-3008
▁own	-3009
Accounts	-3010
">000005	-3011
liver	-3012
tMi	-3013
ines	-3014
="1">&	-3015
:#0	-3016
▁United	-3017
8%;	-3018
▁op	-3019
efd	-3020
-49	-3021
▁&	-3022
Increase	-3023
DeferredTax	-3024
cept	-3025
FrequencyAxis	-3026
MGU	-3027
ebr	-3028
▁Pre	-3029
▁compensation	-3030
arket	-3031
(255,255,255,1);	-3032
▁conditions	-3033
ob	-3034
▁markets	-3035
201912	-3036
202101	-3037
▁2016	-3038
▁various	-3039
Range	-3040
_0	-3041
YzA	-3042
Au	-3043
229,	-3044
Schedule	-3045
vel	-3046
ebruary	-3047
Corporate	-3048
su	-3049
-09-	-3050
▁ro	-3051
▁instru	-3052
Zjg	-3053
▁Note	-3054
-25	-3055
:120%">&#160;</	-3056
▁global	-3057
▁effect	-3058
ading	-3059
▁author	-3060
Mzc	-3061
NzY	-3062
3/	-3063
cl	-3064
829	-3065
▁6	-3066
ZWE	-3067
▁support	-3068
1.	-3069
FiniteLived	-3070
▁method	-3071
Valuation	-3072
RiY	-3073
MzQx	-3074
tives	-3075
urther	-3076
InstrumentAxis	-3077
onths	-3078
▁enter	-3079
▁estimates	-3080
▁Is	-3081
ZDI	-3082
IO	-3083
ZmE	-3084
139	-3085
:27	-3086
$<	-3087
NF	-3088
ely	-3089
urchases	-3090
arg	-3091
vZnJhZzoz	-3092
▁distr	-3093
orrow	-3094
inated	-3095
Ret	-3096
ZTM	-3097
▁impairment	-3098
340	-3099
Benefits	-3100
orth	-3101
312	-3102
MjQy	-3103
alc	-3104
▁center	-3105
Exchange	-3106
ExpenseBenefit	-3107
▁reason	-3108
▁cre	-3109
OWVh	-3110
-19	-3111
vdG	-3112
30-	-3113
▁Exhibit	-3114
https	-3115
ise	-3116
▁Consolidated	-3117
Obligation	-3118
20220	-3119
▁world	-3120
▁notes	-3121
Acquisition	-3122
▁purchase	-3123
_2	-3124
▁regulatory	-3125
>2025-12-31</	-3126
▁there	-3127
▁property	-3128
ZmU	-3129
ination	-3130
▁determ	-3131
YmNi	-3132
_00	-3133
Johnson	-3134
recognized	-3135
▁unc	-3136
-44	-3137
YWJsZTpm	-3138
ech	-3139
:32	-3140
▁companies	-3141
ership	-3142
MV	-3143
2134	-3144
:45	-3145
OperatingLease	-3146
▁4	-3147
-46	-3148
res	-3149
▁assess	-3150
sic	-3151
▁respon	-3152
Yzg	-3153
Group	-3154
TO	-3155
▁programs	-3156
5%">	-3157
▁liability	-3158
-48	-3159
Nzk	-3160
OTQx	-3161
▁sell	-3162
DuringPeriod	-3163
▁differ	-3164
als	-3165
jOjc	-3166
cto	-3167
AA	-3168
ission	-3169
▁demand	-3170
20201231"><	-3171
▁left	-3172
;">&#160;	-3173
*</	-3174
▁prior	-3175
▁deferred	-3176
▁gu	-3177
clud	-3178
reas	-3179
ENT	-3180
anti	-3181
▁payment	-3182
ms	-3183
irc	-3184
pared	-3185
sidiaries	-3186
▁higher	-3187
ources	-3188
▁sol	-3189
AccumulatedOther	-3190
▁commercial	-3191
ctober	-3192
vZnJhZzph	-3193
▁high	-3194
▁er	-3195
▁expect	-3196
5">	-3197
▁suppli	-3198
ministr	-3199
▁bg	-3200
vZnJhZzox	-3201
cmFn	-3202
loud	-3203
:4.	-3204
ScheduleOf	-3205
ZTU	-3206
mcmFn	-3207
ety	-3208
▁bgcolor	-3209
4;	-3210
▁mod	-3211
purchase	-3212
Decrease	-3213
NjRh	-3214
Allowance	-3215
Capital	-3216
NA	-3217
3414	-3218
▁table	-3219
:120%">(	-3220
▁#000000">&	-3221
▁includes	-3222
;">%</	-3223
▁sho	-3224
ish	-3225
emaining	-3226
▁pt	-3227
aly	-3228
MtMS	-3229
hief	-3230
:100%;"><	-3231
▁Comm	-3232
ticipa	-3233
▁Q	-3234
RecurringMember	-3235
rant	-3236
▁repres	-3237
:#0068	-3238
atform	-3239
▁offset	-3240
:10.	-3241
Zjc	-3242
▁environ	-3243
vZnJhZzpi	-3244
YWJsZTow	-3245
Earnings	-3246
▁claims	-3247
Flow	-3248
▁prices	-3249
▁security	-3250
▁standard	-3251
Carrying	-3252
▁instruments	-3253
▁issued	-3254
NDQy	-3255
▁Text	-3256
20</	-3257
-15	-3258
ile	-3259
▁Reg	-3260
YWJsZTpl	-3261
CashFlow	-3262
onal	-3263
▁economic	-3264
AR	-3265
loss	-3266
1)</	-3267
▁sec	-3268
▁redu	-3269
88</	-3270
wer	-3271
RlL	-3272
ZTk	-3273
BORDER	-3274
6770;	-3275
▁President	-3276
BR	-3277
▁ter	-3278
▁2022	-3279
vZnJhZzoy	-3280
uZ	-3281
YjBh	-3282
:22.5	-3283
-10-	-3284
▁outstanding	-3285
ended	-3286
▁tyle	-3287
▁lower	-3288
▁Agreement	-3289
▁Europe	-3290
202012	-3291
▁arr	-3292
vZnJhZzpj	-3293
ml	-3294
▁had	-3295
ZGE	-3296
oard	-3297
Not	-3298
DC	-3299
▁incorporated	-3300
_0000	-3301
▁#3	-3302
▁yle	-3303
FE	-3304
ensed	-3305
▁styl	-3306
▁height	-3307
129	-3308
ada	-3309
note	-3310
istrant	-3311
▁deliver	-3312
Outstanding	-3313
▁experience	-3314
ContractMember	-3315
party	-3316
YWJsZTph	-3317
.0</	-3318
▁upon	-3319
ged	-3320
▁ext	-3321
OTNi	-3322
:14.5	-3323
_9	-3324
Paid	-3325
:125	-3326
_7	-3327
Consolidated	-3328
2021_	-3329
Employee	-3330
▁dri	-3331
cmFuZ	-3332
LTMtMS	-3333
EquitySecurities	-3334
Years	-3335
▁val	-3336
ands	-3337
Expected	-3338
▁2020,	-3339
erica	-3340
work	-3341
▁profit	-3342
ZDk	-3343
▁about	-3344
RangeAxis	-3345
RhYmxlcmFuZ	-3346
out	-3347
▁2023	-3348
="4"	-3349
▁Officer	-3350
YWJsZTpj	-3351
▁potential	-3352
▁level	-3353
MmE	-3354
ili	-3355
▁rights	-3356
▁see	-3357
_202	-3358
▁background	-3359
ermin	-3360
YzVh	-3361
▁pension	-3362
">000001	-3363
ented	-3364
vZnJhZzpk	-3365
_5	-3366
ZDU	-3367
jOjA	-3368
ks	-3369
uris	-3370
341439	-3371
2018_	-3372
vision	-3373
/200	-3374
OTBl	-3375
-29	-3376
▁Con	-3377
▁Tr	-3378
5.	-3379
▁some	-3380
▁incur	-3381
">4	-3382
MWY	-3383
▁believe	-3384
">1</	-3385
MGM	-3386
rect	-3387
26</	-3388
▁commit	-3389
▁exis	-3390
▁If	-3391
ovember	-3392
ited	-3393
ful	-3394
_4	-3395
pay	-3396
/0000	-3397
-26	-3398
-28	-3399
Depreciation	-3400
IncomeTaxRate	-3401
▁regard	-3402
IncomeStatement	-3403
otnote	-3404
CC	-3405
IncomeLossFrom	-3406
▁September	-3407
DD	-3408
aximum	-3409
XzEw	-3410
-11	-3411
ZDM	-3412
▁No	-3413
jpg	-3414
▁condition	-3415
▁xml	-3416
25</	-3417
yber	-3418
▁Exchange	-3419
12</	-3420
:#0075	-3421
count	-3422
YWJsZToy	-3423
▁1,	-3424
▁impac	-3425
SeniorNotes	-3426
▁assumptions	-3427
▁terms	-3428
">2	-3429
anagement	-3430
entive	-3431
Cons	-3432
▁Y	-3433
▁legal	-3434
reasury	-3435
ending	-3436
▁sale	-3437
="1%"></	-3438
MGNh	-3439
Addition	-3440
NmQ	-3441
pendent	-3442
-42	-3443
ences	-3444
tNS	-3445
urity	-3446
centr	-3447
▁May	-3448
olicies	-3449
▁2022,	-3450
ors	-3451
lish	-3452
▁public	-3453
urisdic	-3454
00</	-3455
▁ful	-3456
20211231"><	-3457
Ojd	-3458
▁make	-3459
YjFi	-3460
▁industry	-3461
pep	-3462
:-12	-3463
ps	-3464
referred	-3465
NWY	-3466
FB	-3467
Short	-3468
78901	-3469
▁software	-3470
ai	-3471
double	-3472
:5.0	-3473
▁Oper	-3474
YWJsZTox	-3475
YWJsZToz	-3476
3799	-3477
▁volum	-3478
IS	-3479
▁applicable	-3480
▁but	-3481
uccess	-3482
>&	-3483
▁2024	-3484
▁China	-3485
Related	-3486
▁0.0);	-3487
▁oil	-3488
934	-3489
▁2023,	-3490
▁pers	-3491
bG	-3492
verti	-3493
Proceeds	-3494
▁less	-3495
ministrative	-3496
▁among	-3497
jOjk	-3498
Ml	-3499
ZjU	-3500
oper	-3501
▁war	-3502
billion	-3503
Ba	-3504
▁supply	-3505
hether	-3506
year	-3507
Costs	-3508
▁evalu	-3509
▁manufacturing	-3510
eo	-3511
urchased	-3512
▁recogn	-3513
">3,	-3514
▁impro	-3515
▁Securities	-3516
esc	-3517
3;	-3518
NmRl	-3519
ummar	-3520
_7">	-3521
icing	-3522
vZnJhZzpm	-3523
vZnJhZzpl	-3524
▁uncertain	-3525
▁dated	-3526
▁revi	-3527
:7.	-3528
:9.	-3529
NTI	-3530
▁Annual	-3531
MGIw	-3532
▁made	-3533
▁est	-3534
NWQ	-3535
gative	-3536
tional	-3537
▁2021,	-3538
202009	-3539
▁October	-3540
erch	-3541
ollars	-3542
uance	-3543
▁capa	-3544
Position	-3545
-41	-3546
10-	-3547
erci	-3548
ZDE	-3549
▁initi	-3550
DE	-3551
▁lit	-3552
▁distribu	-3553
nel	-3554
ZDA	-3555
Open	-3556
inimum	-3557
cu	-3558
▁platform	-3559
Impa	-3560
8605	-3561
.032	-3562
Form	-3563
IncludingPortion	-3564
une	-3565
Name	-3566
▁2.5	-3567
21</	-3568
apit	-3569
NjQx	-3570
_12	-3571
TableTextBlock	-3572
Currency	-3573
-43	-3574
▁settle	-3575
FiscalYear	-3576
▁countries	-3577
aran	-3578
AwardTypeAxis	-3579
▁xmlns	-3580
Xzg	-3581
dits	-3582
IncreaseDecrease	-3583
TextSe	-3584
▁Other	-3585
▁item	-3586
YzE	-3587
YWJsZTpk	-3588
TextSelection	-3589
Parent	-3590
▁12.25	-3591
▁fail	-3592
eries	-3593
_8	-3594
▁first	-3595
▁financing	-3596
▁compared	-3597
Divid	-3598
>(<	-3599
Njll	-3600
▁act	-3601
▁whether	-3602
:1.94%;	-3603
:6.	-3604
FibG	-3605
▁stor	-3606
MmY	-3607
FA	-3608
▁subst	-3609
▁td	-3610
ici	-3611
arge	-3612
OtherThan	-3613
▁international	-3614
BC	-3615
grega	-3616
continued	-3617
▁2024,	-3618
fle	-3619
▁where	-3620
▁negative	-3621
_0001163165_	-3622
="-3"	-3623
Ind	-3624
pos	-3625
▁Intern	-3626
Fund	-3627
ortized	-3628
318605	-3629
▁Ref	-3630
;">1	-3631
▁both	-3632
ZDRm	-3633
ality	-3634
▁ty	-3635
▁jurisdic	-3636
▁divid	-3637
ZTE	-3638
ani	-3639
related	-3640
IncomeTaxes	-3641
▁St	-3642
Basis	-3643
▁gains	-3644
vZnJhZzow	-3645
SegmentAxis	-3646
erivatives	-3647
ular	-3648
>%	-3649
▁sim	-3650
▁AND	-3651
pliance	-3652
:-	-3653
/2003/	-3654
:0.530	-3655
Recognized	-3656
7.	-3657
15"	-3658
ests	-3659
NmZl	-3660
inc	-3661
▁This	-3662
BenefitPlans	-3663
uild	-3664
00016	-3665
MjRk	-3666
Market	-3667
▁leases	-3668
:100%">1,	-3669
EMENT	-3670
531"	-3671
25"	-3672
▁state	-3673
_3	-3674
len	-3675
DA	-3676
▁below	-3677
Yjgz	-3678
▁technologies	-3679
sist	-3680
0;"><	-3681
ause	-3682
acility	-3683
▁access	-3684
="2">	-3685
tsla	-3686
▁success	-3687
▁ado	-3688
▁Can	-3689
Five	-3690
MTFl	-3691
▁businesses	-3692
▁parties	-3693
ibm	-3694
:96.032	-3695
▁model	-3696
eneral	-3697
▁actions	-3698
▁held	-3699
Loans	-3700
-17	-3701
Treasury	-3702
▁paid	-3703
▁provided	-3704
igh	-3705
xom	-3706
▁mon	-3707
▁regarding	-3708
▁derivative	-3709
▁Direc	-3710
nder	-3711
▁vi	-3712
▁network	-3713
▁occ	-3714
▁limit	-3715
Hedge	-3716
ister	-3717
LongTermDebt	-3718
NlYzpm	-3719
alcul	-3720
▁disc	-3721
▁facilities	-3722
">&#	-3723
,&#8221;	-3724
ustr	-3725
YThh	-3726
▁periods	-3727
▁Executive	-3728
15</	-3729
EFF	-3730
erve	-3731
ZGUw	-3732
▁Rus	-3733
▁report	-3734
FR	-3735
▁adv	-3736
NDYy	-3737
▁charges	-3738
MWFh	-3739
acc	-3740
▁ing	-3741
-27	-3742
wide	-3743
339	-3744
Additional	-3745
▁lead	-3746
▁integr	-3747
202112	-3748
tNC	-3749
3%;	-3750
divid	-3751
YWJsZTpi	-3752
UtMS	-3753
;">&#8226;</	-3754
▁ear	-3755
NzZj	-3756
▁consumer	-3757
▁Credit	-3758
omes	-3759
LTI	-3760
▁strateg	-3761
-14	-3762
.5</	-3763
Jan	-3764
YWFh	-3765
▁intangible	-3766
▁#0068	-3767
▁carrying	-3768
Major	-3769
YmUw	-3770
sible	-3771
▁maintain	-3772
lected	-3773
▁existing	-3774
tionAnd	-3775
▁0.0)	-3776
Acquired	-3777
suant	-3778
jOjI	-3779
▁row	-3780
▁litigation	-3781
educ	-3782
467	-3783
.&#160;	-3784
▁2025	-3785
▁conn	-3786
▁receivables	-3787
Zjcw	-3788
ilar	-3789
▁meet	-3790
pfe	-3791
Payable	-3792
19</	-3793
Government	-3794
Xzk	-3795
2%;	-3796
BA	-3797
ink	-3798
:1.00	-3799
py	-3800
▁reported	-3801
Adjustments	-3802
8230</	-3803
siz	-3804
▁most	-3805
ned	-3806
ging	-3807
">0000018230</	-3808
Used	-3809
ulti	-3810
ABLE	-3811
▁US	-3812
▁arrang	-3813
:12.64	-3814
Yjhj	-3815
isa	-3816
CCE	-3817
inal	-3818
▁comprehensive	-3819
RlMD	-3820
▁offic	-3821
▁rg	-3822
vdGFibG	-3823
pril	-3824
▁portion	-3825
ode	-3826
">000005114	-3827
Yzli	-3828
229,229,	-3829
ByTypeAxis	-3830
▁Tax	-3831
erio	-3832
▁Board	-3833
">0000051143</	-3834
69%;	-3835
▁transaction	-3836
Issued	-3837
▁rgba	-3838
▁return	-3839
201909	-3840
After	-3841
orcl	-3842
▁accord	-3843
▁discus	-3844
▁further	-3845
MTkx	-3846
▁require	-3847
▁">	-3848
ZjA	-3849
▁Chief	-3850
▁Item	-3851
▁follows	-3852
Unrecognized	-3853
2018</	-3854
▁></	-3855
&#8220;	-3856
MmYy	-3857
NTQx	-3858
ZDZh	-3859
68</	-3860
▁perform	-3861
lassified	-3862
ZTRi	-3863
LTUtMS	-3864
ponents	-3865
2017</	-3866
▁matters	-3867
ZGVm	-3868
▁events	-3869
ZDQx	-3870
19312	-3871
-35	-3872
';">&#160;</	-3873
">6	-3874
ZTYx	-3875
adb	-3876
18</	-3877
ently	-3878
:112	-3879
▁suppliers	-3880
▁short	-3881
▁rowspan	-3882
▁need	-3883
BD	-3884
▁loc	-3885
▁before	-3886
▁jud	-3887
:28	-3888
Assumptions	-3889
/000119312	-3890
">00016	-3891
▁reduc	-3892
▁awards	-3893
▁&#8211;	-3894
▁federal	-3895
MWM	-3896
box	-3897
bac	-3898
FinanceLease	-3899
-</	-3900
ow	-3901
FROM	-3902
4%;">	-3903
▁affected	-3904
:130%;	-3905
porting	-3906
ress	-3907
▁exam	-3908
YjZh	-3909
ZDQw	-3910
▁Accounting	-3911
ProceedsFrom	-3912
▁borrow	-3913
YTEy	-3914
NmYz	-3915
▁enti	-3916
footnote	-3917
▁adjustments	-3918
ZTcz	-3919
▁expos	-3920
servable	-3921
tructure	-3922
▁Al	-3923
tomo	-3924
▁major	-3925
MGFk	-3926
:13.28	-3927
▁subsidiaries	-3928
▁Fr	-3929
UR	-3930
Continuing	-3931
▁hold	-3932
ZWNl	-3933
CCEEFF	-3934
▁0.5	-3935
>2023-01-01</	-3936
▁inventory	-3937
▁principal	-3938
asing	-3939
MTFk	-3940
▁standards	-3941
limin	-3942
Reserves	-3943
RiNT	-3944
sequ	-3945
▁invol	-3946
▁acquired	-3947
▁#262626;	-3948
BE	-3949
tomotive	-3950
▁policies	-3951
Maximum	-3952
32</	-3953
ma	-3954
14</	-3955
RjYj	-3956
Two	-3957
0">	-3958
406</	-3959
▁poli	-3960
▁cour	-3961
▁Cond	-3962
eriodic	-3963
arm	-3964
RmY	-3965
vested	-3966
20181231"	-3967
CIAL	-3968
▁cover	-3969
ries	-3970
▁many	-3971
dependent	-3972
Receivables	-3973
▁license	-3974
▁partn	-3975
▁substanti	-3976
:0.25	-3977
▁u	-3978
apitalized	-3979
YTNk	-3980
OtherThanOptions	-3981
▁ng	-3982
bination	-3983
Services	-3984
37996</	-3985
Policy	-3986
80</	-3987
189</	-3988
20180101-	-3989
▁February	-3990
▁contrib	-3991
OTZl	-3992
adi	-3993
▁options	-3994
▁merch	-3995
LTItMS	-3996
YmRl	-3997
12,	-3998
▁Condensed	-3999
________	-4000
▁across	-4001
▁average	-4002
:100%">1	-4003
">0000037996</	-4004
Subsegment	-4005
▁health	-4006
▁equivalents	-4007
▁cyber	-4008
▁values	-4009
dividual	-4010
NDRj	-4011
ablish	-4012
▁agreement	-4013
cluded	-4014
▁portfolio	-4015
2019</	-4016
▁direct	-4017
▁March	-4018
▁vehicles	-4019
MDVi	-4020
tack	-4021
:125%">	-4022
ising	-4023
▁fl	-4024
INAN	-4025
ViY	-4026
TaxBenefits	-4027
:54	-4028
uly	-4029
ules	-4030
▁dam	-4031
20180	-4032
">00010	-4033
-30	-4034
lear	-4035
▁annual	-4036
▁infr	-4037
Zy	-4038
110	-4039
▁gas	-4040
;">2,	-4041
:30	-4042
ION	-4043
igital	-4044
80;"><	-4045
INANCIAL	-4046
▁Ar	-4047
▁2019,	-4048
:0.69%;	-4049
YmZl	-4050
▁prac	-4051
Orig	-4052
▁#808080;"><	-4053
cedures	-4054
2022_	-4055
▁On	-4056
ested	-4057
YjQz	-4058
AE	-4059
OTYx	-4060
">4,	-4061
497	-4062
34</	-4063
OTcy	-4064
858</	-4065
posi	-4066
security	-4067
Co	-4068
ATEMENT	-4069
▁judgment	-4070
LL	-4071
dity	-4072
ind	-4073
OTRj	-4074
:13.5	-4075
Change	-4076
iluted	-4077
▁general	-4078
emic	-4079
:14.	-4080
ably	-4081
;">20	-4082
YjRi	-4083
▁gran	-4084
ClassOf	-4085
▁coll	-4086
▁identif	-4087
▁dr	-4088
:5.2	-4089
▁span	-4090
200406</	-4091
eful	-4092
InPeriod	-4093
NiOD	-4094
ShortTerm	-4095
▁disp	-4096
3"><	-4097
▁consum	-4098
">0000200406</	-4099
▁cli	-4100
▁Ended	-4101
▁three	-4102
gregate	-4103
ica	-4104
▁decrease	-4105
▁13	-4106
plement	-4107
▁accounts	-4108
justed	-4109
centration	-4110
NTkw	-4111
NlYzpk	-4112
-34	-4113
▁November	-4114
see	-4115
dia	-4116
Facility	-4117
▁conf	-4118
494	-4119
ODRi	-4120
DesignationAxis	-4121
-31	-4122
341439_	-4123
>2018-12-31</	-4124
Translation	-4125
:-2.8	-4126
▁funds	-4127
▁jurisdictions	-4128
▁corporate	-4129
closures	-4130
xLTEtMT	-4131
_0001341439_	-4132
Set	-4133
▁resulting	-4134
Losses	-4135
▁parti	-4136
35</	-4137
8%;">	-4138
▁pan	-4139
Discontinued	-4140
Entities	-4141
11,	-4142
AzYj	-4143
▁adding	-4144
▁transf	-4145
7800	-4146
ko	-4147
33</	-4148
YTZi	-4149
arb	-4150
495	-4151
XzEx	-4152
NzVh	-4153
ginning	-4154
▁establish	-4155
orable	-4156
aler	-4157
Commercial	-4158
▁Statement	-4159
EF	-4160
3-4	-4161
tili	-4162
atus	-4163
▁#5	-4164
▁(&#8220;	-4165
Performance	-4166
▁test	-4167
▁above	-4168
▁Income	-4169
▁marketing	-4170
▁fe	-4171
NumberOf	-4172
2-4	-4173
:11.	-4174
:-3	-4175
▁estimate	-4176
unit	-4177
324	-4178
;">201	-4179
▁trade	-4180
▁To	-4181
QxMW	-4182
Refs	-4183
▁hedg	-4184
ince	-4185
YWc	-4186
jOmMx	-4187
Intern	-4188
▁reduce	-4189
704	-4190
:-3.5	-4191
31_2019_	-4192
▁compliance	-4193
30_	-4194
11</	-4195
ZyYWc	-4196
Dividends	-4197
▁2025,	-4198
ously	-4199
▁sold	-4200
atural	-4201
ZjJm	-4202
▁Visa	-4203
▁circ	-4204
▁Lo	-4205
aff	-4206
ically	-4207
29"	-4208
▁determin	-4209
ZTRh	-4210
>2017	-4211
▁being	-4212
:114	-4213
Originated	-4214
▁here	-4215
Sharebased	-4216
Stated	-4217
26"	-4218
Diluted	-4219
▁review	-4220
eople	-4221
FmOD	-4222
QtMS	-4223
▁ign	-4224
315189</	-4225
▁Bank	-4226
No	-4227
Mzli	-4228
▁histor	-4229
YjJk	-4230
erti	-4231
▁June	-4232
paddi	-4233
▁reasonable	-4234
NameAxis	-4235
086	-4236
▁Sup	-4237
▁px	-4238
▁class	-4239
31_2021_	-4240
jOjY	-4241
▁multi	-4242
-36	-4243
ery	-4244
789019_	-4245
▁add	-4246
az	-4247
-06-	-4248
Nzlk	-4249
▁ding	-4250
">0000315189</	-4251
_0000789019_	-4252
▁om	-4253
▁because	-4254
29-	-4255
Yzdh	-4256
Basic	-4257
▁rele	-4258
ateral	-4259
▁priv	-4260
quidity	-4261
tories	-4262
▁proj	-4263
putation	-4264
▁gre	-4265
acy	-4266
stances	-4267
Matur	-4268
ern	-4269
▁disru	-4270
CreditFacility	-4271
ercise	-4272
-5"	-4273
914	-4274
ilit	-4275
▁local	-4276
▁materially	-4277
▁volume	-4278
evelopment	-4279
ature	-4280
alties	-4281
▁pricing	-4282
▁similar	-4283
black	-4284
▁saf	-4285
alysis	-4286
ZTNj	-4287
▁cri	-4288
1-4	-4289
oid	-4290
▁alloc	-4291
▁employee	-4292
Char	-4293
CD	-4294
28"	-4295
AllowanceFor	-4296
27"	-4297
nergy	-4298
8.	-4299
▁dding	-4300
_10_29	-4301
75</	-4302
paddin	-4303
YTVh	-4304
▁">&	-4305
mited	-4306
posal	-4307
▁America	-4308
6.	-4309
